I've spent a whole day yesterday and quite a bit of overtime experimenting with provider and testing cloud-init functionality specifically and here's my observations.

PART I
In short, CI (cloud-init) cloud-config works as expected at least in userdata part. I didn't test vendor/network/meta because i've got no use for it but i have no reason to believe it won't work.
As i already mentioned somewhere in other issues Proxmox executes cloud-init in somewhat "unconventional" way (at least i'm not used to it compared to how cloud providers deal with it) generating an ISO image for it with the data and mounting it in CD-ROM drive. It also allows to regenerate said image and reapply configuration it contains (for example add a new ssh-key for a user), which is not usually the case with the cloud stuff where cloud-config applied only once at the first boot (or more precisely some modules of CI).

I'm not sure if people are aware but things that Proxmox exposes in it's GUI for Cloud-Init is just a small subset of what cloud-config is capable of. These things are what provider can control via "initialization.dns", "initialization.ip_config" and "initialization.user_account" (btw @bpg there seem to be no way for provider to change "Upgrade packages" option as in GUI?):
![image](https://github.com/bpg/terraform-provider-proxmox/assets/123507924/f8b7ce9f-51d1-4180-8e89-ccc681bd58b1)

But that is in no way a full extent of what could be done via cloud-config and by using provider's arguments like "user_data_file_id" (or network/vendor/meta ones) we could inject our own custom cloud-init cloud-config.
My own mistake (and probably most people with this issue are doing the same) was that i expected to see changes in exposed parameters of cloud-init in Proxmox's GUI - it won't happen although after booting up all the config's parameters would be applied. 
I also do not fully understand that weird magic Proxmox does with cloud-init so it confuses me alot.
For example (and i think THIS is what provider does or emulates when we inject custom cloud-config via "proxmox_virtual_environment_file") i used a console utility "qm" to inject my custom cloud-config into an image and bake it in template afterwards. Documentation also mentions that you could dump cloud-init info contained inside an image but this somehow never worked for me (for CUSTOM cloud-config anyway, but it shows info you put in the GUI fields of cloud-init).
An example:

```
qm set
...
--cicustom [meta=<volume>] [,network=<volume>] [,user=<volume>] [,vendor=<volume>]
           cloud-init: Specify custom files to replace the automatically generated ones at start.
           

# freshly baked template with an injected cloud-config shows nothing for it
root@prox-srv1:~# qm cloudinit dump 1011 user
#cloud-config
hostname: template-ubuntu-22
manage_etc_hosts: true
fqdn: template-ubuntu-22.04
chpasswd:
  expire: False
users:
  - default
package_upgrade: true

# i try to inject cloud-config via console tool but it still shows nothing afterwads
root@prox-srv1:~# qm set 1011 --cicustom "user=local:snippets/userdata-proxmox.yml"
update VM 1011: -cicustom user=local:snippets/userdata-proxmox.yml

root@prox-srv1:~# qm cloudinit dump 1011 user
#cloud-config
hostname: template-ubuntu-22
manage_etc_hosts: true
fqdn: template-ubuntu-22.04
chpasswd:
  expire: False
users:
  - default
package_upgrade: true

# but if i change "User" field of Cloud-Init in Proxmox's GUI it detects changes
root@prox-srv1:~# qm cloudinit dump 1011 user
#cloud-config
hostname: template-ubuntu-22
manage_etc_hosts: true
fqdn: template-ubuntu-22.04
user: WOLOLO <<<< CHANGED!
chpasswd:
  expire: False
users:
  - default
package_upgrade: true
```
In the end it's very weird for me how Proxmox handles cloud-init and i'm not sure what exactly it shows via "qm cloudinit dump". Why it's only reflection of GUI's changes i've no clue...
Maybe some Proxmox guru could explain it or @bpg himself (at least on provider's part, how it handles all that stuff).
The only thing i want to reiterate again - if you inject custom cloud-config into your vm/template do not expect to see any changes in the Proxmox's GUI in Cloud-Init. It won't be show in "qm cloudinit dump" either.

PART II
That's content of my custom cloud-config:
```
ratiborus@HOMEWORLD:~/WORKSPACE/terraform_yandex/proxmox$ cat ../keys/userdata-proxmox.yml
#cloud-config
hostname: px-cloud-config-applied
users:
  - name: tf
    groups: adm,sudo
    shell: /bin/bash
    sudo: ['ALL=(ALL) NOPASSWD:ALL']
    ssh-authorized-keys:
      - ssh-rsa AAAABsomelongstring== tf

packages:
- qemu-guest-agent
package_upgrade: true

runcmd:
  - systemctl enable --now qemu-guest-agent
  - echo "done" > /tmp/user-cloud-init-done

final_message: |
  cloud-init has finished
  version: $version
  timestamp: $timestamp
  datasource: $datasource
  uptime: $uptime
  Ratiborus was here... 
```

And here's 3 different implementations for injecting custom cloud-init cloud-config for userdata, and all of them work:
- cloud-config is kept in a dedicated yaml file and "imported" inside resource directly as external file; probably they way i'd use it if not one small issue i'll mention a bit later...
- cloud-config is kept in a dedicated yaml file and "imported" inside resource as raw data via "file" function of terraform that renders content of an external file; my favourite way of all so far but there may be unintended consequences, i didn't test it much
- cloud-config is kept inline inside terraform manifest and "imported" inside resource as raw data; probably the worst implementation because you keep potentially changeable data inside infrastructure manifest, but may work in some cases where you don't use modules or need a fast way to test something
```
#==================#
#   CLOUD-CONFIG   #
#==================#

resource "proxmox_virtual_environment_file" "cloud_config_userdata" {
  content_type = "snippets"
  datastore_id = "local"
  node_name    = "prox-srv1"
  source_file {
    path = "../keys/userdata-proxmox.yml"
  }
}

resource "proxmox_virtual_environment_file" "cloud_config_userdata_raw_file" {
  content_type = "snippets"
  datastore_id = "local"
  node_name    = "prox-srv1"
  source_raw {
    data = file("../keys/userdata-proxmox.yml")
    file_name = "userdata-proxmox-raw-file.yml"
  }
}

resource "proxmox_virtual_environment_file" "cloud_config_userdata_raw" {
  content_type = "snippets"
  datastore_id = "local"
  node_name    = "prox-srv1"
  source_raw {
    data = <<EOF
#cloud-config
hostname: px-cloud-config-applied
packages:
  - qemu-guest-agent
users:
  - name: tf
    groups: sudo
    shell: /bin/bash
    ssh-authorized-keys:
      - ssh-rsa some_long_key
    sudo: ALL=(ALL) NOPASSWD:ALL
runcmd:
    - systemctl enable --now qemu-guest-agent
    - echo "done" > /tmp/user-cloud-init-done
EOF

    file_name = "userdata-proxmox-raw.yml"
  }
}
```

And now about the issue with the first implementation i mentioned earlier.
If you change your external file that is getting imported into Proxmox's snippets datastore these changes are not visible for provider and resource will stay the same. Most likely because provider checks only existence of a file by its name. But if we "import" raw source even as rendered external file then provider sees changes and acts accordingly. The same thing probably happens with cloud images being imported into ISO datastore.
Maybe if provider checked and compared checksum of source and target files every plan and tried to recreate resource (re-download file) if changes are detected it would work better. We could also re-download any distribution's cloud images when they get updated. But i'm not sure if it's something feasible or easily implemented or even wanted by most people.
What do you think, @bpg?

Here's an example:
```
module.proxmox.proxmox_virtual_environment_file.cloud_config_userdata_raw_file: Creating...
module.proxmox.proxmox_virtual_environment_file.cloud_config_userdata: Creating...
module.proxmox.proxmox_virtual_environment_file.cloud_config_userdata: Creation complete after 1s [id=local:snippets/userdata-proxmox.yml]
module.proxmox.proxmox_virtual_environment_file.cloud_config_userdata_raw_file: Creation complete after 1s [id=local:snippets/userdata-proxmox-raw-file.yml]

###
do some changes to source file "../keys/userdata-proxmox.yml", i added installation of vim and htop packages
###

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.proxmox.proxmox_virtual_environment_file.cloud_config_userdata_raw_file must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_config_userdata_raw_file" {
      + file_modification_date = (known after apply)
      ~ file_name              = "userdata-proxmox-raw-file.yml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/userdata-proxmox-raw-file.yml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                #cloud-config
                hostname: px-cloud-config-applied
                users:
                  - name: tf
                    groups: adm,sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    ssh-authorized-keys:
                      - ssh-rsa AAAABsomelongstring== tf

                packages:
                - qemu-guest-agent
              + - vim
              + - htop
                package_upgrade: true

                runcmd:
                  - systemctl enable --now qemu-guest-agent
                  - echo "done" > /tmp/user-cloud-init-done

                final_message: |
                  cloud-init has finished
                  version: $version
                  timestamp: $timestamp
                  datasource: $datasource
                  uptime: $uptime
                  Ratiborus was here...
            EOT
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```